node {
  name: "parallel_read/input_producer/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 200
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 200
          }
        }
        string_val: "/content/dataset/train_gbucket/1_1119_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_104_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_130_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1074_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1054test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1097_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1073test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1061_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1068_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_146_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1374test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1053_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1494test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1040_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_13_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1041_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_100_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_134_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1036_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1120_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_12_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1089_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1009_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1065_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1346test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1069_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1032_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1054_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1118_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_105_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1230test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_128_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_113_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1104test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_106_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_120_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1037_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1014_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1050_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1506test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_107_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1122_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1091_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1084_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1013_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_112_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1064_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1353test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_141_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1009test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1243test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_118_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_126test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_103_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1085_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_149_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1072_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1380test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_132_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1142test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1063_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1027_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1044_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1438test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1417test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1056_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1355test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1071_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1075_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_104_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1348test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1060_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1459test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_100_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_124_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1033_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1094_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1215test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_117_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_144_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_14_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1049_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_136_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1047_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1232test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1081_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1247test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_11_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1051_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_131_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1410test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1073_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_126_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_143_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_110_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1010_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_137_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1059_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1088_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_108_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_125_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1034_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_129_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_105_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_102_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1086_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1086test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1048_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_140_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_127_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_119_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_150_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1029_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1079_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1046_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_139_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1078_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_11_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1258test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_112_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_101_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1121_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_103_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1096_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1123_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_109_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_151test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_110_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1578test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1093_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1083_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_109_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1042_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1012_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_122_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1030_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_123_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1031_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1087_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1182test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_10_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1390test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1080_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_107_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_142_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1327test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1077_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_115_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1058_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1092_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1039_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1095_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_114_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1062_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1055_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_108_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1533test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_106_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_101_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1098_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_138_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_16_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1038_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_111_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1067_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1011_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1454test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1166test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_133_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_147_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_121_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1427test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1045_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_135_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_10_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1052_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1333test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1169test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_102_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1021test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_111_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_148_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1057_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_15_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1117_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1035_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_107test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1070_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1082_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1076_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1028_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1090_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_116_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1530test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_112test_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_145_1.tfr"
        string_val: "/content/dataset/train_gbucket/1_1043_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1066_0.tfr"
        string_val: "/content/dataset/train_gbucket/1_1366test_1.tfr"
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Size"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 200
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Greater/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Greater"
  op: "Greater"
  input: "parallel_read/input_producer/Size"
  input: "parallel_read/input_producer/Greater/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Assert/AssertGuard/Switch"
  op: "Switch"
  input: "parallel_read/input_producer/Greater"
  input: "parallel_read/input_producer/Greater"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Assert/AssertGuard/switch_t"
  op: "Identity"
  input: "parallel_read/input_producer/Assert/AssertGuard/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Assert/AssertGuard/switch_f"
  op: "Identity"
  input: "parallel_read/input_producer/Assert/AssertGuard/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Assert/AssertGuard/pred_id"
  op: "Identity"
  input: "parallel_read/input_producer/Greater"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Assert/AssertGuard/NoOp"
  op: "NoOp"
  input: "^parallel_read/input_producer/Assert/AssertGuard/switch_t"
}
node {
  name: "parallel_read/input_producer/Assert/AssertGuard/control_dependency"
  op: "Identity"
  input: "parallel_read/input_producer/Assert/AssertGuard/switch_t"
  input: "^parallel_read/input_producer/Assert/AssertGuard/NoOp"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/input_producer/Assert/AssertGuard/switch_t"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Assert/AssertGuard/Assert/data_0"
  op: "Const"
  input: "^parallel_read/input_producer/Assert/AssertGuard/switch_f"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "string_input_producer requires a non-null input tensor"
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Assert/AssertGuard/Assert/Switch"
  op: "Switch"
  input: "parallel_read/input_producer/Greater"
  input: "parallel_read/input_producer/Assert/AssertGuard/pred_id"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/input_producer/Greater"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Assert/AssertGuard/Assert"
  op: "Assert"
  input: "parallel_read/input_producer/Assert/AssertGuard/Assert/Switch"
  input: "parallel_read/input_producer/Assert/AssertGuard/Assert/data_0"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "parallel_read/input_producer/Assert/AssertGuard/control_dependency_1"
  op: "Identity"
  input: "parallel_read/input_producer/Assert/AssertGuard/switch_f"
  input: "^parallel_read/input_producer/Assert/AssertGuard/Assert"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/input_producer/Assert/AssertGuard/switch_f"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Assert/AssertGuard/Merge"
  op: "Merge"
  input: "parallel_read/input_producer/Assert/AssertGuard/control_dependency_1"
  input: "parallel_read/input_producer/Assert/AssertGuard/control_dependency"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Identity"
  op: "Identity"
  input: "parallel_read/input_producer/Const"
  input: "^parallel_read/input_producer/Assert/AssertGuard/Merge"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 200
          }
        }
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/RandomShuffle"
  op: "RandomShuffle"
  input: "parallel_read/input_producer/Identity"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 200
          }
        }
      }
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "parallel_read/input_producer"
  op: "FIFOQueue"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 32
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "parallel_read/input_producer/input_producer_EnqueueMany"
  op: "QueueEnqueueMany"
  input: "parallel_read/input_producer"
  input: "parallel_read/input_producer/RandomShuffle"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/input_producer"
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "parallel_read/input_producer/input_producer_Close"
  op: "QueueClose"
  input: "parallel_read/input_producer"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/input_producer"
      }
    }
  }
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "parallel_read/input_producer/input_producer_Close_1"
  op: "QueueClose"
  input: "parallel_read/input_producer"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/input_producer"
      }
    }
  }
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "parallel_read/input_producer/input_producer_Size"
  op: "QueueSize"
  input: "parallel_read/input_producer"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/input_producer"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Cast"
  op: "Cast"
  input: "parallel_read/input_producer/input_producer_Size"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/mul/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.03125
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/mul"
  op: "Mul"
  input: "parallel_read/input_producer/Cast"
  input: "parallel_read/input_producer/mul/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/ScalarSummary/tags"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "queue/parallel_read/input_producer/fraction_of_32_full"
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/ScalarSummary"
  op: "ScalarSummary"
  input: "parallel_read/input_producer/ScalarSummary/tags"
  input: "parallel_read/input_producer/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/random_shuffle_queue"
  op: "RandomShuffleQueue"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 40
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "min_after_dequeue"
    value {
      i: 20
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
  attr {
    key: "shapes"
    value {
      list {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "parallel_read/random_shuffle_queue_Size"
  op: "QueueSize"
  input: "parallel_read/random_shuffle_queue"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/random_shuffle_queue"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/ToFloat"
  op: "Cast"
  input: "parallel_read/random_shuffle_queue_Size"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/mul/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0250000003725
      }
    }
  }
}
node {
  name: "parallel_read/mul"
  op: "Mul"
  input: "parallel_read/ToFloat"
  input: "parallel_read/mul/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/ScalarSummary/tags"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "queue/parallel_read/random_shuffle_queue/fraction_of_40_full"
      }
    }
  }
}
node {
  name: "parallel_read/ScalarSummary"
  op: "ScalarSummary"
  input: "parallel_read/ScalarSummary/tags"
  input: "parallel_read/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/TFRecordReader"
  op: "TFRecordReader"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: ""
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "parallel_read/ReaderRead"
  op: "ReaderRead"
  input: "parallel_read/TFRecordReader"
  input: "parallel_read/input_producer"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/TFRecordReader"
        s: "loc:@parallel_read/input_producer"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/random_shuffle_queue_enqueue"
  op: "QueueEnqueue"
  input: "parallel_read/random_shuffle_queue"
  input: "parallel_read/ReaderRead"
  input: "parallel_read/ReaderRead:1"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/random_shuffle_queue"
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "parallel_read/random_shuffle_queue_Close"
  op: "QueueClose"
  input: "parallel_read/random_shuffle_queue"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/random_shuffle_queue"
      }
    }
  }
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "parallel_read/random_shuffle_queue_Close_1"
  op: "QueueClose"
  input: "parallel_read/random_shuffle_queue"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/random_shuffle_queue"
      }
    }
  }
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "parallel_read/random_shuffle_queue_Dequeue"
  op: "QueueDequeue"
  input: "parallel_read/random_shuffle_queue"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/random_shuffle_queue"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "ParseSingleExample/Rank"
  op: "Rank"
  input: "parallel_read/random_shuffle_queue_Dequeue:1"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/Equal/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "ParseSingleExample/Equal"
  op: "Equal"
  input: "ParseSingleExample/Rank"
  input: "ParseSingleExample/Equal/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/SerializedIsScalar/AssertGuard/Switch"
  op: "Switch"
  input: "ParseSingleExample/Equal"
  input: "ParseSingleExample/Equal"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/SerializedIsScalar/AssertGuard/switch_t"
  op: "Identity"
  input: "ParseSingleExample/SerializedIsScalar/AssertGuard/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/SerializedIsScalar/AssertGuard/switch_f"
  op: "Identity"
  input: "ParseSingleExample/SerializedIsScalar/AssertGuard/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/SerializedIsScalar/AssertGuard/pred_id"
  op: "Identity"
  input: "ParseSingleExample/Equal"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/SerializedIsScalar/AssertGuard/NoOp"
  op: "NoOp"
  input: "^ParseSingleExample/SerializedIsScalar/AssertGuard/switch_t"
}
node {
  name: "ParseSingleExample/SerializedIsScalar/AssertGuard/control_dependency"
  op: "Identity"
  input: "ParseSingleExample/SerializedIsScalar/AssertGuard/switch_t"
  input: "^ParseSingleExample/SerializedIsScalar/AssertGuard/NoOp"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ParseSingleExample/SerializedIsScalar/AssertGuard/switch_t"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/SerializedIsScalar/AssertGuard/Assert/data_0"
  op: "Const"
  input: "^ParseSingleExample/SerializedIsScalar/AssertGuard/switch_f"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Input serialized must be a scalar"
      }
    }
  }
}
node {
  name: "ParseSingleExample/SerializedIsScalar/AssertGuard/Assert/Switch"
  op: "Switch"
  input: "ParseSingleExample/Equal"
  input: "ParseSingleExample/SerializedIsScalar/AssertGuard/pred_id"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ParseSingleExample/Equal"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/SerializedIsScalar/AssertGuard/Assert"
  op: "Assert"
  input: "ParseSingleExample/SerializedIsScalar/AssertGuard/Assert/Switch"
  input: "ParseSingleExample/SerializedIsScalar/AssertGuard/Assert/data_0"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "ParseSingleExample/SerializedIsScalar/AssertGuard/control_dependency_1"
  op: "Identity"
  input: "ParseSingleExample/SerializedIsScalar/AssertGuard/switch_f"
  input: "^ParseSingleExample/SerializedIsScalar/AssertGuard/Assert"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ParseSingleExample/SerializedIsScalar/AssertGuard/switch_f"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/SerializedIsScalar/AssertGuard/Merge"
  op: "Merge"
  input: "ParseSingleExample/SerializedIsScalar/AssertGuard/control_dependency_1"
  input: "ParseSingleExample/SerializedIsScalar/AssertGuard/control_dependency"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/SerializedDependencies"
  op: "Identity"
  input: "parallel_read/random_shuffle_queue_Dequeue:1"
  input: "^ParseSingleExample/SerializedIsScalar/AssertGuard/Merge"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/random_shuffle_queue"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "ParseSingleExample/ExpandDims"
  op: "ExpandDims"
  input: "ParseSingleExample/SerializedDependencies"
  input: "ParseSingleExample/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/ParseExample/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/ParseExample/Const_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/ParseExample/Const_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/ParseExample/ParseExample/names"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/ParseExample/ParseExample/dense_keys_0"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "data"
      }
    }
  }
}
node {
  name: "ParseSingleExample/ParseExample/ParseExample/dense_keys_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "filename"
      }
    }
  }
}
node {
  name: "ParseSingleExample/ParseExample/ParseExample/dense_keys_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "label"
      }
    }
  }
}
node {
  name: "ParseSingleExample/ParseExample/ParseExample"
  op: "ParseExample"
  input: "ParseSingleExample/ExpandDims"
  input: "ParseSingleExample/ParseExample/ParseExample/names"
  input: "ParseSingleExample/ParseExample/ParseExample/dense_keys_0"
  input: "ParseSingleExample/ParseExample/ParseExample/dense_keys_1"
  input: "ParseSingleExample/ParseExample/ParseExample/dense_keys_2"
  input: "ParseSingleExample/ParseExample/Const"
  input: "ParseSingleExample/ParseExample/Const_1"
  input: "ParseSingleExample/ParseExample/Const_2"
  attr {
    key: "Ndense"
    value {
      i: 3
    }
  }
  attr {
    key: "Nsparse"
    value {
      i: 0
    }
  }
  attr {
    key: "Tdense"
    value {
      list {
        type: DT_FLOAT
        type: DT_STRING
        type: DT_INT64
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 3840000
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "dense_shapes"
    value {
      list {
        shape {
          dim {
            size: 3840000
          }
        }
        shape {
        }
        shape {
        }
      }
    }
  }
  attr {
    key: "sparse_types"
    value {
      list {
      }
    }
  }
}
node {
  name: "ParseSingleExample/Squeeze_data"
  op: "Squeeze"
  input: "ParseSingleExample/ParseExample/ParseExample"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3840000
          }
        }
      }
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "ParseSingleExample/Squeeze_filename"
  op: "Squeeze"
  input: "ParseSingleExample/ParseExample/ParseExample:1"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "ParseSingleExample/Squeeze_label"
  op: "Squeeze"
  input: "ParseSingleExample/ParseExample/ParseExample:2"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "Reshape/shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "Reshape"
  op: "Reshape"
  input: "ParseSingleExample/Squeeze_filename"
  input: "Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Reshape_1/shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 3840000
      }
    }
  }
}
node {
  name: "Reshape_1"
  op: "Reshape"
  input: "ParseSingleExample/Squeeze_data"
  input: "Reshape_1/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3840000
          }
        }
      }
    }
  }
}
node {
  name: "Reshape_2/shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "Reshape_2"
  op: "Reshape"
  input: "ParseSingleExample/Squeeze_label"
  input: "Reshape_2/shape"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Reshape_3/shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\200\251\003\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "Reshape_3"
  op: "Reshape"
  input: "Reshape_1"
  input: "Reshape_3/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 240000
          }
          dim {
            size: 16
          }
        }
      }
    }
  }
}
node {
  name: "split/split_dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "split"
  op: "Split"
  input: "split/split_dim"
  input: "Reshape_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 4800
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
