node {
  name: "parallel_read/input_producer/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 307
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 307
          }
        }
        string_val: "../dataset/train/3_1743_0.tfr"
        string_val: "../dataset/train/3_20_1.tfr"
        string_val: "../dataset/train/3_123_1.tfr"
        string_val: "../dataset/train/3_199_0.tfr"
        string_val: "../dataset/train/3_98_1.tfr"
        string_val: "../dataset/train/3_1741_0.tfr"
        string_val: "../dataset/train/3_105_1.tfr"
        string_val: "../dataset/train/3_121_1.tfr"
        string_val: "../dataset/train/3_96_1.tfr"
        string_val: "../dataset/train/3_1229_0.tfr"
        string_val: "../dataset/train/3_4_0.tfr"
        string_val: "../dataset/train/3_1410_0.tfr"
        string_val: "../dataset/train/3_251_0.tfr"
        string_val: "../dataset/train/3_966_0.tfr"
        string_val: "../dataset/train/3_108_1.tfr"
        string_val: "../dataset/train/3_751_0.tfr"
        string_val: "../dataset/train/3_662_0.tfr"
        string_val: "../dataset/train/3_55_1.tfr"
        string_val: "../dataset/train/3_87_1.tfr"
        string_val: "../dataset/train/3_1312_0.tfr"
        string_val: "../dataset/train/3_44_0.tfr"
        string_val: "../dataset/train/3_1645_0.tfr"
        string_val: "../dataset/train/3_534_0.tfr"
        string_val: "../dataset/train/3_699_0.tfr"
        string_val: "../dataset/train/3_82_1.tfr"
        string_val: "../dataset/train/3_78_1.tfr"
        string_val: "../dataset/train/3_656_0.tfr"
        string_val: "../dataset/train/3_1712_0.tfr"
        string_val: "../dataset/train/3_102_1.tfr"
        string_val: "../dataset/train/3_80_1.tfr"
        string_val: "../dataset/train/3_149_1.tfr"
        string_val: "../dataset/train/3_152_0.tfr"
        string_val: "../dataset/train/3_659_0.tfr"
        string_val: "../dataset/train/3_132_1.tfr"
        string_val: "../dataset/train/3_1249_0.tfr"
        string_val: "../dataset/train/3_1932_0.tfr"
        string_val: "../dataset/train/3_579_0.tfr"
        string_val: "../dataset/train/3_22_1.tfr"
        string_val: "../dataset/train/3_90_1.tfr"
        string_val: "../dataset/train/3_2129_0.tfr"
        string_val: "../dataset/train/3_143_1.tfr"
        string_val: "../dataset/train/3_2158_0.tfr"
        string_val: "../dataset/train/3_834_0.tfr"
        string_val: "../dataset/train/3_46_1.tfr"
        string_val: "../dataset/train/3_2228_0.tfr"
        string_val: "../dataset/train/3_1164_0.tfr"
        string_val: "../dataset/train/3_1186_0.tfr"
        string_val: "../dataset/train/3_56_1.tfr"
        string_val: "../dataset/train/3_100_1.tfr"
        string_val: "../dataset/train/3_94_1.tfr"
        string_val: "../dataset/train/3_120_0.tfr"
        string_val: "../dataset/train/3_89_1.tfr"
        string_val: "../dataset/train/3_1109_0.tfr"
        string_val: "../dataset/train/3_84_1.tfr"
        string_val: "../dataset/train/3_4_1.tfr"
        string_val: "../dataset/train/3_184_0.tfr"
        string_val: "../dataset/train/3_1184_0.tfr"
        string_val: "../dataset/train/3_17_1.tfr"
        string_val: "../dataset/train/3_32_0.tfr"
        string_val: "../dataset/train/3_92_1.tfr"
        string_val: "../dataset/train/3_827_0.tfr"
        string_val: "../dataset/train/3_1931_0.tfr"
        string_val: "../dataset/train/3_2231_0.tfr"
        string_val: "../dataset/train/3_1797_0.tfr"
        string_val: "../dataset/train/3_1694_0.tfr"
        string_val: "../dataset/train/3_33_1.tfr"
        string_val: "../dataset/train/3_72_1.tfr"
        string_val: "../dataset/train/3_1946_0.tfr"
        string_val: "../dataset/train/3_2208_0.tfr"
        string_val: "../dataset/train/3_1579_0.tfr"
        string_val: "../dataset/train/3_113_1.tfr"
        string_val: "../dataset/train/3_958_0.tfr"
        string_val: "../dataset/train/3_68_1.tfr"
        string_val: "../dataset/train/3_10_1.tfr"
        string_val: "../dataset/train/3_418_0.tfr"
        string_val: "../dataset/train/3_125_1.tfr"
        string_val: "../dataset/train/3_116_1.tfr"
        string_val: "../dataset/train/3_97_1.tfr"
        string_val: "../dataset/train/3_37_1.tfr"
        string_val: "../dataset/train/3_539_0.tfr"
        string_val: "../dataset/train/3_7_1.tfr"
        string_val: "../dataset/train/3_47_1.tfr"
        string_val: "../dataset/train/3_1980_0.tfr"
        string_val: "../dataset/train/3_118_1.tfr"
        string_val: "../dataset/train/3_40_1.tfr"
        string_val: "../dataset/train/3_946_0.tfr"
        string_val: "../dataset/train/3_8_1.tfr"
        string_val: "../dataset/train/3_30_1.tfr"
        string_val: "../dataset/train/3_147_1.tfr"
        string_val: "../dataset/train/3_179_0.tfr"
        string_val: "../dataset/train/3_150_1.tfr"
        string_val: "../dataset/train/3_1711_0.tfr"
        string_val: "../dataset/train/3_146_1.tfr"
        string_val: "../dataset/train/3_850_0.tfr"
        string_val: "../dataset/train/3_1385_0.tfr"
        string_val: "../dataset/train/3_57_1.tfr"
        string_val: "../dataset/train/3_1022_0.tfr"
        string_val: "../dataset/train/3_77_1.tfr"
        string_val: "../dataset/train/3_15_1.tfr"
        string_val: "../dataset/train/3_83_1.tfr"
        string_val: "../dataset/train/3_110_1.tfr"
        string_val: "../dataset/train/3_1728_0.tfr"
        string_val: "../dataset/train/3_42_1.tfr"
        string_val: "../dataset/train/3_488_0.tfr"
        string_val: "../dataset/train/3_61_1.tfr"
        string_val: "../dataset/train/3_2104_0.tfr"
        string_val: "../dataset/train/3_122_1.tfr"
        string_val: "../dataset/train/3_581_0.tfr"
        string_val: "../dataset/train/3_38_1.tfr"
        string_val: "../dataset/train/3_131_1.tfr"
        string_val: "../dataset/train/3_49_1.tfr"
        string_val: "../dataset/train/3_142_1.tfr"
        string_val: "../dataset/train/3_2_1.tfr"
        string_val: "../dataset/train/3_133_1.tfr"
        string_val: "../dataset/train/3_59_1.tfr"
        string_val: "../dataset/train/3_640_0.tfr"
        string_val: "../dataset/train/3_18_1.tfr"
        string_val: "../dataset/train/3_39_1.tfr"
        string_val: "../dataset/train/3_21_1.tfr"
        string_val: "../dataset/train/3_54_1.tfr"
        string_val: "../dataset/train/3_395_0.tfr"
        string_val: "../dataset/train/3_472_0.tfr"
        string_val: "../dataset/train/3_119_1.tfr"
        string_val: "../dataset/train/3_1023_0.tfr"
        string_val: "../dataset/train/3_69_1.tfr"
        string_val: "../dataset/train/3_60_1.tfr"
        string_val: "../dataset/train/3_1548_0.tfr"
        string_val: "../dataset/train/3_63_1.tfr"
        string_val: "../dataset/train/3_730_0.tfr"
        string_val: "../dataset/train/3_134_1.tfr"
        string_val: "../dataset/train/3_130_1.tfr"
        string_val: "../dataset/train/3_62_1.tfr"
        string_val: "../dataset/train/3_1747_0.tfr"
        string_val: "../dataset/train/3_23_1.tfr"
        string_val: "../dataset/train/3_53_1.tfr"
        string_val: "../dataset/train/3_1673_0.tfr"
        string_val: "../dataset/train/3_44_1.tfr"
        string_val: "../dataset/train/3_1448_0.tfr"
        string_val: "../dataset/train/3_34_1.tfr"
        string_val: "../dataset/train/3_126_1.tfr"
        string_val: "../dataset/train/3_1911_0.tfr"
        string_val: "../dataset/train/3_782_0.tfr"
        string_val: "../dataset/train/3_947_0.tfr"
        string_val: "../dataset/train/3_79_0.tfr"
        string_val: "../dataset/train/3_1604_0.tfr"
        string_val: "../dataset/train/3_79_1.tfr"
        string_val: "../dataset/train/3_169_0.tfr"
        string_val: "../dataset/train/3_282_0.tfr"
        string_val: "../dataset/train/3_104_1.tfr"
        string_val: "../dataset/train/3_106_1.tfr"
        string_val: "../dataset/train/3_645_0.tfr"
        string_val: "../dataset/train/3_2004_0.tfr"
        string_val: "../dataset/train/3_748_0.tfr"
        string_val: "../dataset/train/3_1300_0.tfr"
        string_val: "../dataset/train/3_883_0.tfr"
        string_val: "../dataset/train/3_28_1.tfr"
        string_val: "../dataset/train/3_3_1.tfr"
        string_val: "../dataset/train/3_420_0.tfr"
        string_val: "../dataset/train/3_2003_0.tfr"
        string_val: "../dataset/train/3_135_1.tfr"
        string_val: "../dataset/train/3_75_1.tfr"
        string_val: "../dataset/train/3_2133_0.tfr"
        string_val: "../dataset/train/3_101_1.tfr"
        string_val: "../dataset/train/3_127_1.tfr"
        string_val: "../dataset/train/3_1010_0.tfr"
        string_val: "../dataset/train/3_99_1.tfr"
        string_val: "../dataset/train/3_1_1.tfr"
        string_val: "../dataset/train/3_956_0.tfr"
        string_val: "../dataset/train/3_76_1.tfr"
        string_val: "../dataset/train/3_170_0.tfr"
        string_val: "../dataset/train/3_196_0.tfr"
        string_val: "../dataset/train/3_14_1.tfr"
        string_val: "../dataset/train/3_19_1.tfr"
        string_val: "../dataset/train/3_29_1.tfr"
        string_val: "../dataset/train/3_66_1.tfr"
        string_val: "../dataset/train/3_471_0.tfr"
        string_val: "../dataset/train/3_57_0.tfr"
        string_val: "../dataset/train/3_1937_0.tfr"
        string_val: "../dataset/train/3_91_1.tfr"
        string_val: "../dataset/train/3_1869_0.tfr"
        string_val: "../dataset/train/3_969_0.tfr"
        string_val: "../dataset/train/3_354_0.tfr"
        string_val: "../dataset/train/3_65_1.tfr"
        string_val: "../dataset/train/3_465_0.tfr"
        string_val: "../dataset/train/3_1640_0.tfr"
        string_val: "../dataset/train/3_97_0.tfr"
        string_val: "../dataset/train/3_777_0.tfr"
        string_val: "../dataset/train/3_24_1.tfr"
        string_val: "../dataset/train/3_64_1.tfr"
        string_val: "../dataset/train/3_670_0.tfr"
        string_val: "../dataset/train/3_74_1.tfr"
        string_val: "../dataset/train/3_935_0.tfr"
        string_val: "../dataset/train/3_1453_0.tfr"
        string_val: "../dataset/train/3_2215_0.tfr"
        string_val: "../dataset/train/3_402_0.tfr"
        string_val: "../dataset/train/3_45_1.tfr"
        string_val: "../dataset/train/3_841_0.tfr"
        string_val: "../dataset/train/3_93_1.tfr"
        string_val: "../dataset/train/3_1313_0.tfr"
        string_val: "../dataset/train/3_1153_0.tfr"
        string_val: "../dataset/train/3_2121_0.tfr"
        string_val: "../dataset/train/3_1287_0.tfr"
        string_val: "../dataset/train/3_405_0.tfr"
        string_val: "../dataset/train/3_1323_0.tfr"
        string_val: "../dataset/train/3_275_0.tfr"
        string_val: "../dataset/train/3_58_1.tfr"
        string_val: "../dataset/train/3_2227_0.tfr"
        string_val: "../dataset/train/3_138_1.tfr"
        string_val: "../dataset/train/3_88_1.tfr"
        string_val: "../dataset/train/3_115_1.tfr"
        string_val: "../dataset/train/3_136_1.tfr"
        string_val: "../dataset/train/3_236_0.tfr"
        string_val: "../dataset/train/3_1089_0.tfr"
        string_val: "../dataset/train/3_1435_0.tfr"
        string_val: "../dataset/train/3_51_1.tfr"
        string_val: "../dataset/train/3_600_0.tfr"
        string_val: "../dataset/train/3_1329_0.tfr"
        string_val: "../dataset/train/3_879_0.tfr"
        string_val: "../dataset/train/3_1852_0.tfr"
        string_val: "../dataset/train/3_16_1.tfr"
        string_val: "../dataset/train/3_1150_0.tfr"
        string_val: "../dataset/train/3_360_0.tfr"
        string_val: "../dataset/train/3_52_1.tfr"
        string_val: "../dataset/train/3_1890_0.tfr"
        string_val: "../dataset/train/3_114_1.tfr"
        string_val: "../dataset/train/3_149_0.tfr"
        string_val: "../dataset/train/3_144_1.tfr"
        string_val: "../dataset/train/3_9_1.tfr"
        string_val: "../dataset/train/3_27_1.tfr"
        string_val: "../dataset/train/3_163_0.tfr"
        string_val: "../dataset/train/3_1877_0.tfr"
        string_val: "../dataset/train/3_137_1.tfr"
        string_val: "../dataset/train/3_103_1.tfr"
        string_val: "../dataset/train/3_36_1.tfr"
        string_val: "../dataset/train/3_86_1.tfr"
        string_val: "../dataset/train/3_1706_0.tfr"
        string_val: "../dataset/train/3_333_0.tfr"
        string_val: "../dataset/train/3_602_0.tfr"
        string_val: "../dataset/train/3_111_1.tfr"
        string_val: "../dataset/train/3_689_0.tfr"
        string_val: "../dataset/train/3_110_0.tfr"
        string_val: "../dataset/train/3_1858_0.tfr"
        string_val: "../dataset/train/3_1806_0.tfr"
        string_val: "../dataset/train/3_13_1.tfr"
        string_val: "../dataset/train/3_1769_0.tfr"
        string_val: "../dataset/train/3_1376_0.tfr"
        string_val: "../dataset/train/3_617_0.tfr"
        string_val: "../dataset/train/3_454_0.tfr"
        string_val: "../dataset/train/3_2031_0.tfr"
        string_val: "../dataset/train/3_112_1.tfr"
        string_val: "../dataset/train/3_120_1.tfr"
        string_val: "../dataset/train/3_48_1.tfr"
        string_val: "../dataset/train/3_192_0.tfr"
        string_val: "../dataset/train/3_41_0.tfr"
        string_val: "../dataset/train/3_1137_0.tfr"
        string_val: "../dataset/train/3_70_1.tfr"
        string_val: "../dataset/train/3_148_1.tfr"
        string_val: "../dataset/train/3_455_0.tfr"
        string_val: "../dataset/train/3_113_0.tfr"
        string_val: "../dataset/train/3_5_1.tfr"
        string_val: "../dataset/train/3_1759_0.tfr"
        string_val: "../dataset/train/3_109_1.tfr"
        string_val: "../dataset/train/3_32_1.tfr"
        string_val: "../dataset/train/3_117_1.tfr"
        string_val: "../dataset/train/3_1078_0.tfr"
        string_val: "../dataset/train/3_823_0.tfr"
        string_val: "../dataset/train/3_1811_0.tfr"
        string_val: "../dataset/train/3_889_0.tfr"
        string_val: "../dataset/train/3_31_1.tfr"
        string_val: "../dataset/train/3_43_1.tfr"
        string_val: "../dataset/train/3_1745_0.tfr"
        string_val: "../dataset/train/3_35_1.tfr"
        string_val: "../dataset/train/3_71_1.tfr"
        string_val: "../dataset/train/3_145_1.tfr"
        string_val: "../dataset/train/3_85_1.tfr"
        string_val: "../dataset/train/3_67_1.tfr"
        string_val: "../dataset/train/3_107_1.tfr"
        string_val: "../dataset/train/3_95_1.tfr"
        string_val: "../dataset/train/3_41_1.tfr"
        string_val: "../dataset/train/3_1180_0.tfr"
        string_val: "../dataset/train/3_2083_0.tfr"
        string_val: "../dataset/train/3_1966_0.tfr"
        string_val: "../dataset/train/3_1134_0.tfr"
        string_val: "../dataset/train/3_128_1.tfr"
        string_val: "../dataset/train/3_1881_0.tfr"
        string_val: "../dataset/train/3_11_1.tfr"
        string_val: "../dataset/train/3_1337_0.tfr"
        string_val: "../dataset/train/3_6_1.tfr"
        string_val: "../dataset/train/3_124_1.tfr"
        string_val: "../dataset/train/3_2028_0.tfr"
        string_val: "../dataset/train/3_81_1.tfr"
        string_val: "../dataset/train/3_902_0.tfr"
        string_val: "../dataset/train/3_139_1.tfr"
        string_val: "../dataset/train/3_1230_0.tfr"
        string_val: "../dataset/train/3_980_0.tfr"
        string_val: "../dataset/train/3_1467_0.tfr"
        string_val: "../dataset/train/3_73_1.tfr"
        string_val: "../dataset/train/3_1162_0.tfr"
        string_val: "../dataset/train/3_25_1.tfr"
        string_val: "../dataset/train/3_1885_0.tfr"
        string_val: "../dataset/train/3_1951_0.tfr"
        string_val: "../dataset/train/3_50_1.tfr"
        string_val: "../dataset/train/3_129_1.tfr"
        string_val: "../dataset/train/3_1872_0.tfr"
        string_val: "../dataset/train/3_12_1.tfr"
        string_val: "../dataset/train/3_26_1.tfr"
        string_val: "../dataset/train/3_355_0.tfr"
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Size"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 307
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Greater/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Greater"
  op: "Greater"
  input: "parallel_read/input_producer/Size"
  input: "parallel_read/input_producer/Greater/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Assert/AssertGuard/Switch"
  op: "Switch"
  input: "parallel_read/input_producer/Greater"
  input: "parallel_read/input_producer/Greater"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Assert/AssertGuard/switch_t"
  op: "Identity"
  input: "parallel_read/input_producer/Assert/AssertGuard/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Assert/AssertGuard/switch_f"
  op: "Identity"
  input: "parallel_read/input_producer/Assert/AssertGuard/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Assert/AssertGuard/pred_id"
  op: "Identity"
  input: "parallel_read/input_producer/Greater"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Assert/AssertGuard/NoOp"
  op: "NoOp"
  input: "^parallel_read/input_producer/Assert/AssertGuard/switch_t"
}
node {
  name: "parallel_read/input_producer/Assert/AssertGuard/control_dependency"
  op: "Identity"
  input: "parallel_read/input_producer/Assert/AssertGuard/switch_t"
  input: "^parallel_read/input_producer/Assert/AssertGuard/NoOp"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/input_producer/Assert/AssertGuard/switch_t"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Assert/AssertGuard/Assert/data_0"
  op: "Const"
  input: "^parallel_read/input_producer/Assert/AssertGuard/switch_f"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "string_input_producer requires a non-null input tensor"
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Assert/AssertGuard/Assert/Switch"
  op: "Switch"
  input: "parallel_read/input_producer/Greater"
  input: "parallel_read/input_producer/Assert/AssertGuard/pred_id"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/input_producer/Greater"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Assert/AssertGuard/Assert"
  op: "Assert"
  input: "parallel_read/input_producer/Assert/AssertGuard/Assert/Switch"
  input: "parallel_read/input_producer/Assert/AssertGuard/Assert/data_0"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "parallel_read/input_producer/Assert/AssertGuard/control_dependency_1"
  op: "Identity"
  input: "parallel_read/input_producer/Assert/AssertGuard/switch_f"
  input: "^parallel_read/input_producer/Assert/AssertGuard/Assert"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/input_producer/Assert/AssertGuard/switch_f"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Assert/AssertGuard/Merge"
  op: "Merge"
  input: "parallel_read/input_producer/Assert/AssertGuard/control_dependency_1"
  input: "parallel_read/input_producer/Assert/AssertGuard/control_dependency"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Identity"
  op: "Identity"
  input: "parallel_read/input_producer/Const"
  input: "^parallel_read/input_producer/Assert/AssertGuard/Merge"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 307
          }
        }
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/RandomShuffle"
  op: "RandomShuffle"
  input: "parallel_read/input_producer/Identity"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 307
          }
        }
      }
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "parallel_read/input_producer"
  op: "FIFOQueue"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 32
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "parallel_read/input_producer/input_producer_EnqueueMany"
  op: "QueueEnqueueMany"
  input: "parallel_read/input_producer"
  input: "parallel_read/input_producer/RandomShuffle"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/input_producer"
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "parallel_read/input_producer/input_producer_Close"
  op: "QueueClose"
  input: "parallel_read/input_producer"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/input_producer"
      }
    }
  }
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "parallel_read/input_producer/input_producer_Close_1"
  op: "QueueClose"
  input: "parallel_read/input_producer"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/input_producer"
      }
    }
  }
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "parallel_read/input_producer/input_producer_Size"
  op: "QueueSize"
  input: "parallel_read/input_producer"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/input_producer"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/Cast"
  op: "Cast"
  input: "parallel_read/input_producer/input_producer_Size"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/mul/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.03125
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/mul"
  op: "Mul"
  input: "parallel_read/input_producer/Cast"
  input: "parallel_read/input_producer/mul/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/ScalarSummary/tags"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "queue/parallel_read/input_producer/fraction_of_32_full"
      }
    }
  }
}
node {
  name: "parallel_read/input_producer/ScalarSummary"
  op: "ScalarSummary"
  input: "parallel_read/input_producer/ScalarSummary/tags"
  input: "parallel_read/input_producer/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/random_shuffle_queue"
  op: "RandomShuffleQueue"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 40
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "min_after_dequeue"
    value {
      i: 20
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
  attr {
    key: "shapes"
    value {
      list {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "parallel_read/random_shuffle_queue_Size"
  op: "QueueSize"
  input: "parallel_read/random_shuffle_queue"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/random_shuffle_queue"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/ToFloat"
  op: "Cast"
  input: "parallel_read/random_shuffle_queue_Size"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/mul/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0250000003725
      }
    }
  }
}
node {
  name: "parallel_read/mul"
  op: "Mul"
  input: "parallel_read/ToFloat"
  input: "parallel_read/mul/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/ScalarSummary/tags"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "queue/parallel_read/random_shuffle_queue/fraction_of_40_full"
      }
    }
  }
}
node {
  name: "parallel_read/ScalarSummary"
  op: "ScalarSummary"
  input: "parallel_read/ScalarSummary/tags"
  input: "parallel_read/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/TFRecordReader"
  op: "TFRecordReader"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: ""
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "parallel_read/ReaderRead"
  op: "ReaderRead"
  input: "parallel_read/TFRecordReader"
  input: "parallel_read/input_producer"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/TFRecordReader"
        s: "loc:@parallel_read/input_producer"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "parallel_read/random_shuffle_queue_enqueue"
  op: "QueueEnqueue"
  input: "parallel_read/random_shuffle_queue"
  input: "parallel_read/ReaderRead"
  input: "parallel_read/ReaderRead:1"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/random_shuffle_queue"
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "parallel_read/random_shuffle_queue_Close"
  op: "QueueClose"
  input: "parallel_read/random_shuffle_queue"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/random_shuffle_queue"
      }
    }
  }
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "parallel_read/random_shuffle_queue_Close_1"
  op: "QueueClose"
  input: "parallel_read/random_shuffle_queue"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/random_shuffle_queue"
      }
    }
  }
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "parallel_read/random_shuffle_queue_Dequeue"
  op: "QueueDequeue"
  input: "parallel_read/random_shuffle_queue"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/random_shuffle_queue"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "ParseSingleExample/Rank"
  op: "Rank"
  input: "parallel_read/random_shuffle_queue_Dequeue:1"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/Equal/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "ParseSingleExample/Equal"
  op: "Equal"
  input: "ParseSingleExample/Rank"
  input: "ParseSingleExample/Equal/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/SerializedIsScalar/AssertGuard/Switch"
  op: "Switch"
  input: "ParseSingleExample/Equal"
  input: "ParseSingleExample/Equal"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/SerializedIsScalar/AssertGuard/switch_t"
  op: "Identity"
  input: "ParseSingleExample/SerializedIsScalar/AssertGuard/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/SerializedIsScalar/AssertGuard/switch_f"
  op: "Identity"
  input: "ParseSingleExample/SerializedIsScalar/AssertGuard/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/SerializedIsScalar/AssertGuard/pred_id"
  op: "Identity"
  input: "ParseSingleExample/Equal"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/SerializedIsScalar/AssertGuard/NoOp"
  op: "NoOp"
  input: "^ParseSingleExample/SerializedIsScalar/AssertGuard/switch_t"
}
node {
  name: "ParseSingleExample/SerializedIsScalar/AssertGuard/control_dependency"
  op: "Identity"
  input: "ParseSingleExample/SerializedIsScalar/AssertGuard/switch_t"
  input: "^ParseSingleExample/SerializedIsScalar/AssertGuard/NoOp"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ParseSingleExample/SerializedIsScalar/AssertGuard/switch_t"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/SerializedIsScalar/AssertGuard/Assert/data_0"
  op: "Const"
  input: "^ParseSingleExample/SerializedIsScalar/AssertGuard/switch_f"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Input serialized must be a scalar"
      }
    }
  }
}
node {
  name: "ParseSingleExample/SerializedIsScalar/AssertGuard/Assert/Switch"
  op: "Switch"
  input: "ParseSingleExample/Equal"
  input: "ParseSingleExample/SerializedIsScalar/AssertGuard/pred_id"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ParseSingleExample/Equal"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/SerializedIsScalar/AssertGuard/Assert"
  op: "Assert"
  input: "ParseSingleExample/SerializedIsScalar/AssertGuard/Assert/Switch"
  input: "ParseSingleExample/SerializedIsScalar/AssertGuard/Assert/data_0"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "ParseSingleExample/SerializedIsScalar/AssertGuard/control_dependency_1"
  op: "Identity"
  input: "ParseSingleExample/SerializedIsScalar/AssertGuard/switch_f"
  input: "^ParseSingleExample/SerializedIsScalar/AssertGuard/Assert"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@ParseSingleExample/SerializedIsScalar/AssertGuard/switch_f"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/SerializedIsScalar/AssertGuard/Merge"
  op: "Merge"
  input: "ParseSingleExample/SerializedIsScalar/AssertGuard/control_dependency_1"
  input: "ParseSingleExample/SerializedIsScalar/AssertGuard/control_dependency"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/SerializedDependencies"
  op: "Identity"
  input: "parallel_read/random_shuffle_queue_Dequeue:1"
  input: "^ParseSingleExample/SerializedIsScalar/AssertGuard/Merge"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@parallel_read/random_shuffle_queue"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "ParseSingleExample/ExpandDims"
  op: "ExpandDims"
  input: "ParseSingleExample/SerializedDependencies"
  input: "ParseSingleExample/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/ParseExample/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/ParseExample/Const_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/ParseExample/ParseExample/names"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "ParseSingleExample/ParseExample/ParseExample/dense_keys_0"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "data"
      }
    }
  }
}
node {
  name: "ParseSingleExample/ParseExample/ParseExample/dense_keys_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "label"
      }
    }
  }
}
node {
  name: "ParseSingleExample/ParseExample/ParseExample"
  op: "ParseExample"
  input: "ParseSingleExample/ExpandDims"
  input: "ParseSingleExample/ParseExample/ParseExample/names"
  input: "ParseSingleExample/ParseExample/ParseExample/dense_keys_0"
  input: "ParseSingleExample/ParseExample/ParseExample/dense_keys_1"
  input: "ParseSingleExample/ParseExample/Const"
  input: "ParseSingleExample/ParseExample/Const_1"
  attr {
    key: "Ndense"
    value {
      i: 2
    }
  }
  attr {
    key: "Nsparse"
    value {
      i: 0
    }
  }
  attr {
    key: "Tdense"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT64
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 3840000
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "dense_shapes"
    value {
      list {
        shape {
          dim {
            size: 3840000
          }
        }
        shape {
        }
      }
    }
  }
  attr {
    key: "sparse_types"
    value {
      list {
      }
    }
  }
}
node {
  name: "ParseSingleExample/Squeeze_data"
  op: "Squeeze"
  input: "ParseSingleExample/ParseExample/ParseExample"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3840000
          }
        }
      }
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "ParseSingleExample/Squeeze_label"
  op: "Squeeze"
  input: "ParseSingleExample/ParseExample/ParseExample:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "Reshape/shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 3840000
      }
    }
  }
}
node {
  name: "Reshape"
  op: "Reshape"
  input: "ParseSingleExample/Squeeze_data"
  input: "Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3840000
          }
        }
      }
    }
  }
}
node {
  name: "Reshape_1/shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "Reshape_1"
  op: "Reshape"
  input: "ParseSingleExample/Squeeze_label"
  input: "Reshape_1/shape"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Reshape_2/shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\200\251\003\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "Reshape_2"
  op: "Reshape"
  input: "Reshape"
  input: "Reshape_2/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 240000
          }
          dim {
            size: 16
          }
        }
      }
    }
  }
}
node {
  name: "split/split_dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "split"
  op: "Split"
  input: "split/split_dim"
  input: "Reshape_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
            size: 16
          }
        }
        shape {
          dim {
            size: 2400
          }
          dim {
